rails-intro/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17') ORDER BY release_date
---
  def index
		@all_ratings = Movie.all_ratings		# Initialise the variable so that it can be accessed by the view
		# If there is no history saved, init selected_ratings to default value declared in the movie model
		@selected_ratings = session[:ratings].nil? ? Movie.selected_ratings : session[:ratings]