bdd-tdd-cycle/rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'James Cameron'
---
	def similar
		id = params[:id]
    @movie = Movie.find_by_id(id)
    if @movie.director.blank?